       01  CLIENT-REC.
           05  CL-ID        PIC 9(5).
           05  CL-NAME      PIC X(20).
           05  CL-AGE       PIC 9(2).
           05  CL-CITY      PIC X(15).
