
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTCOPY.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY HELLO.

       PROCEDURE DIVISION.
           DISPLAY WS-MSG
           STOP RUN.
